Show / Hide Table of Contents
Class MaterialBoltGradeHKG
Material bolt grade
Inheritance
System.Object
OpenObject
OpenElementId
Material
MaterialBoltGrade
MaterialBoltGradeHKG
Inherited Members
 MaterialBoltGrade.fub
 MaterialBoltGrade.fyb
 MaterialBoltGrade.Elongation
 MaterialBoltGrade.Code
 MaterialBoltGrade.MprlElementID
 MaterialBoltGrade.MprlTableID
 Material.Name
 Material.LoadFromLibrary
 Material.E
 Material.G
 Material.Poisson
 Material.UnitMass
 Material.SpecificHeat
 Material.ThermalExpansion
 Material.ThermalConductivity
 Material.IsDefaultMaterial
 Material.OrderInCode
 Material.StateOfThermalExpansion
 Material.StateOfThermalConductivity
 Material.StateOfThermalSpecificHeat
 Material.StateOfThermalStressStrain
 Material.StateOfThermalStrain
 Material.UserThermalSpecificHeatCurvature
 Material.UserThermalConductivityCurvature
 Material.UserThermalExpansionCurvature
 Material.UserThermalStrainCurvature
 Material.UserThermalStressStrainCurvature
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Material
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Libraries.Material.HKG.MaterialBoltGradeHKG, CI.Material", "CI.StructModel.Libraries.Material.IMatBoltGradeHKG, CI.BasicTypes", typeof(MaterialBoltGrade))]
public class MaterialBoltGradeHKG : MaterialBoltGrade
Properties
Improve this Doc   View Source
Pbb
Design bearing strength
Declaration
public double Pbb { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Ps
Design shear strength
Declaration
public double Ps { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Pt
Design tension strength
Declaration
public double Pt { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source